#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.iam.data.aws_region.current: Reading...
module.iam.aws_iam_user.this["CS-minwook"]: Refreshing state... [id=CS-minwook]
module.iam.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.iam.aws_iam_user.this["BE-seulgi"]: Refreshing state... [id=BE-seulgi]
module.iam.aws_iam_user.this["PM-hs"]: Refreshing state... [id=PM-hs]
module.iam.aws_iam_user.this["BE-ejinn"]: Refreshing state... [id=BE-ejinn]
module.iam.aws_iam_user.this["CS-wanwoo"]: Refreshing state... [id=CS-wanwoo]
module.iam.aws_iam_user.this["FS-siyeon"]: Refreshing state... [id=FS-siyeon]
module.iam.aws_iam_user.this["CS-jiseo"]: Refreshing state... [id=CS-jiseo]
module.iam.aws_iam_user.this["PD-jbyun"]: Refreshing state... [id=PD-jbyun]
module.iam.aws_iam_user.this["AI-jihyeoniu"]: Refreshing state... [id=AI-jihyeoniu]
module.iam.aws_iam_user.this["CN-wonny"]: Refreshing state... [id=CN-wonny]
module.iam.aws_iam_user.this["FE-hyogi"]: Refreshing state... [id=FE-hyogi]
module.iam.aws_iam_user.this["PM-jehyun"]: Refreshing state... [id=PM-jehyun]
module.iam.aws_iam_user.this["CN-chamchi"]: Refreshing state... [id=CN-chamchi]
module.iam.aws_iam_user.this["AI-donghoon"]: Refreshing state... [id=AI-donghoon]
module.iam.aws_iam_user.this["CN-7eehy3"]: Refreshing state... [id=CN-7eehy3]
module.iam.aws_iam_user.this["PD-seyoun9"]: Refreshing state... [id=PD-seyoun9]
module.oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::497012402578:oidc-provider/token.actions.githubusercontent.com]
aws_dynamodb_table.terraform_lock: Refreshing state... [id=terraform-state-lock]
module.iam.data.aws_caller_identity.current: Reading...
module.iam.aws_iam_role.teamcity: Refreshing state... [id=teamcity-role]
module.iam.aws_iam_group.this["backend"]: Refreshing state... [id=backend]
module.iam.aws_iam_group.this["frontend"]: Refreshing state... [id=frontend]
module.iam.aws_iam_group.this["infra"]: Refreshing state... [id=infra]
module.iam.aws_iam_group.this["projectmanage"]: Refreshing state... [id=projectmanage]
module.iam.aws_iam_group.this["security"]: Refreshing state... [id=security]
module.iam.aws_iam_group.this["AI"]: Refreshing state... [id=AI]
module.oidc.aws_iam_role.github_actions: Refreshing state... [id=github-actions-terraform-role]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=497012402578]
module.iam.aws_iam_user_group_membership.this["PD-jbyun"]: Refreshing state... [id=terraform-20260202060346207900000011]
module.iam.aws_iam_user_group_membership.this["FS-siyeon"]: Refreshing state... [id=terraform-20260202060345697000000008]
module.iam.aws_iam_user_group_membership.this["AI-donghoon"]: Refreshing state... [id=terraform-20260202060346556600000018]
module.iam.aws_iam_user_group_membership.this["PD-seyoun9"]: Refreshing state... [id=terraform-20260202060346528500000017]
module.iam.aws_iam_user_group_membership.this["CN-chamchi"]: Refreshing state... [id=terraform-20260202060346457200000013]
module.iam.aws_iam_user_group_membership.this["CS-minwook"]: Refreshing state... [id=terraform-2026020206034668570000001a]
module.iam.aws_iam_user_group_membership.this["FE-hyogi"]: Refreshing state... [id=terraform-20260202060346497400000015]
module.iam.aws_iam_user_group_membership.this["PM-jehyun"]: Refreshing state... [id=terraform-20260202060346497400000014]
module.iam.aws_iam_user_group_membership.this["CN-wonny"]: Refreshing state... [id=terraform-2026020206034685560000001b]
module.iam.aws_iam_user_group_membership.this["CN-7eehy3"]: Refreshing state... [id=terraform-20260202060346356100000012]
module.iam.aws_iam_user_group_membership.this["BE-ejinn"]: Refreshing state... [id=terraform-2026020206034697560000001d]
module.iam.aws_iam_user_group_membership.this["CS-jiseo"]: Refreshing state... [id=terraform-20260202060346528300000016]
module.iam.aws_iam_user_group_membership.this["BE-seulgi"]: Refreshing state... [id=terraform-20260202060348486100000020]
module.iam.aws_iam_user_group_membership.this["AI-jihyeoniu"]: Refreshing state... [id=terraform-20260202060349156500000021]
module.iam.aws_iam_user_group_membership.this["CS-wanwoo"]: Refreshing state... [id=terraform-2026020206034603750000000f]
module.iam.aws_iam_user_group_membership.this["PM-hs"]: Refreshing state... [id=terraform-2026020206034691620000001c]
module.iam.aws_iam_group_policy_attachment.this["infra-arn:aws:iam::aws:policy/AdministratorAccess"]: Refreshing state... [id=infra-20260202060345497400000002]
module.iam.aws_iam_group_policy_attachment.this["frontend-arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"]: Refreshing state... [id=frontend-20260202060346585800000019]
module.iam.aws_iam_group_policy_attachment.this["projectmanage-arn:aws:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=projectmanage-20260202060345486100000001]
module.iam.aws_iam_group_policy_attachment.this["security-arn:aws:iam::aws:policy/AWSWAFConsoleFullAccess"]: Refreshing state... [id=security-2026020206034603740000000e]
module.iam.aws_iam_group_policy_attachment.this["AI-arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly"]: Refreshing state... [id=AI-20260202060345507400000004]
module.iam.aws_iam_group_policy_attachment.this["frontend-arn:aws:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=frontend-2026020206034706600000001f]
module.iam.aws_iam_group_policy_attachment.this["infra-arn:aws:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=infra-20260202060345845700000009]
module.iam.aws_iam_group_policy_attachment.this["security-arn:aws:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=security-2026020206034600570000000c]
module.iam.aws_iam_group_policy_attachment.this["backend-arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"]: Refreshing state... [id=backend-20260202060345516000000006]
module.iam.aws_iam_group_policy_attachment.this["AI-arn:aws:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=AI-2026020206034703600000001e]
module.iam.aws_iam_group_policy_attachment.this["security-arn:aws:iam::aws:policy/AWSCloudTrail_ReadOnlyAccess"]: Refreshing state... [id=security-2026020206034601600000000d]
module.iam.aws_iam_group_policy_attachment.this["projectmanage-arn:aws:iam::aws:policy/AWSBillingReadOnlyAccess"]: Refreshing state... [id=projectmanage-20260202060346037500000010]
module.iam.aws_iam_group_policy_attachment.this["backend-arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly"]: Refreshing state... [id=backend-2026020206034599710000000b]
module.iam.aws_iam_group_policy_attachment.this["backend-arn:aws:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=backend-20260202060345507400000005]
module.iam.aws_iam_group_policy_attachment.this["security-arn:aws:iam::aws:policy/SecurityAudit"]: Refreshing state... [id=security-20260202060345525800000007]
module.iam.aws_iam_group_policy_attachment.this["AI-arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"]: Refreshing state... [id=AI-2026020206034599710000000a]
module.iam.aws_iam_group_policy_attachment.this["frontend-arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly"]: Refreshing state... [id=frontend-20260202060345497400000003]
module.iam.aws_iam_role_policy_attachment.teamcity: Refreshing state... [id=teamcity-role/arn:aws:iam::aws:policy/AdministratorAccess]
module.iam.aws_iam_instance_profile.teamcity: Refreshing state... [id=teamcity-instance-profile]
module.oidc.aws_iam_role_policy_attachment.admin: Refreshing state... [id=github-actions-terraform-role/arn:aws:iam::aws:policy/AdministratorAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.iam.aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.iam.aws_iam_policy.github_actions will be created
  + resource "aws_iam_policy" "github_actions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for GitHub Actions CI/CD"
      + id               = (known after apply)
      + name             = "github-actions-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECRAccess"
                    },
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                          + "eks:ListClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:eks:ap-northeast-2:497012402578:cluster/*"
                      + Sid      = "EKSAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::goormgb-terraform-state",
                          + "arn:aws:s3:::goormgb-terraform-state/*",
                        ]
                      + Sid      = "S3TerraformState"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-northeast-2:497012402578:table/terraform-lock"
                      + Sid      = "DynamoDBTerraformLock"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ap-northeast-2:497012402578:secret:goormgb/*"
                      + Sid      = "SecretsManagerRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-role"
      + name_prefix           = (known after apply)
      + path                  = "/services/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.github_actions will be created
  + resource "aws_iam_role_policy_attachment" "github_actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "github-actions-role"
    }

  # module.iam.aws_iam_role_policy_attachment.teamcity must be replaced
-/+ resource "aws_iam_role_policy_attachment" "teamcity" {
      ~ id         = "teamcity-role/arn:aws:iam::aws:policy/AdministratorAccess" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Warning: Deprecated attribute

  on modules/iam/roles.tf line 83, in resource "aws_iam_policy" "github_actions":
  83:         Resource = "arn:aws:eks:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:cluster/*"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @212clab*